# candy = 10
# while candy > 0:
#     print("едим конфеты" , candy)
#     candy = candy -1

# count =1
# while count <20: #условие
#     print(count) #2
#     count += 1 # к переменной добавляем 1
# print("end of loop") #покажет только один раз, так как не относится к другим

# ages = [12,14,78,46,93] #список возрастов
# count = 0 # переменная для шага
# while count < len(ages): # пока count, меньше, чем длина списка
#     if ages[count] <18: # ages [0] < 18 (12<18)
#         print("нельзя", ages[count]) #
#     else:
#         print("можно", ages[count])
#     count += 1 # для конца цикла


# count = 0
# while count < 5: # 5 покупателей
#     age = int(input("введите возраст: ")) # спрашиваем возраст
#     if age <18: # проверка
#         print("nope")
#     else:
#         print("yup")
#     count +=1 #продолжение/ конец цикла


# count = 1
# while count < 10:
#     if count % 2 ==0:
#         print(count)
#     count += 1




#написать программу которая принимает 3 фильма и добавляет их в список
#через цикл

# count  = 0
# my_list = [] #мой
# while count < 3: # 0-3, 1-3
#     film = input("дайте фильм: ") #клиент
#     my_list.append(film)
#     count += 1
# print(my_list)

films = ["love" ,""]